/*
Задание 1. Агрегатные функции и группировка результатов запроса
1. Каков средний вес груза, отправляющегося в Атланту?
2. Сколько грузов отправил клиент 433?
3. Перечислить идентификаторы клиентов, все грузы которых имеют вес свыше 25
кг
4. Перечислить идентификаторы клиентов, отправлявших все свои грузы в один и
тот же город (этот город может быть, а может и не быть общим для всех таких
клиентов)
5. Каков максимальный вес груза, доставленного в каждый город?
6. Для каждого города, в который отправлено не менее трёх грузов, выяснить
средний вес груза, отправленного в этот город
*/

/* 1.1 Каков средний вес груза, отправляющегося в Атланту?*/
Select AVG (weight) as Average_Weight
From Transportation
Where City='Атланта'

/* 1.2 Сколько грузов отправил клиент 433?*/
Select COUNT(*)
From Transportation
Where ClientId='433'

/* 1.3 Перечислить идентификаторы клиентов, все грузы которых имеют вес свыше 25
кг*/
Select DISTINCT ClientId
From Transportation
Where Weight > 25

/* 1.4 Перечислить идентификаторы клиентов, отправлявших все свои грузы в один и
тот же город (этот город может быть, а может и не быть общим для всех таких
клиентов)*/
Select DISTINCT ClientId
From Transportation
Group by ClientId
Having count(distinct City) =1

/* 1.5 Каков максимальный вес груза, доставленного в каждый город?*/
Select City, MAX (Weight)
From Transportation
Group by City

/* 1.6 Для каждого города, в который отправлено не менее трёх грузов, выяснить
средний вес груза, отправленного в этот город*/
Select City, round(AVG(weight),2) as Average_Weight
From Transportation
Group by City
Having count(TransportationId) >=3*/

/*
Задание 2. Подзапросы
1. Перечислить города, получавшие грузы от клиентов с годовым доходом свыше
15 миллионов долларов
2. Перечислить имена и фамилии водителей, доставлявших грузы весом более 100
кг
3. Перечислить названия и годовые доходы клиентов, отправлявших грузы со
средним весом более 100 кг
4. Перечислить названия и годовые доходы клиентов, чьи грузы доставлял
водитель по имени Джон
5. Перечислить имена водителей, доставлявших грузы весом более 1000 кг, с
указанием городов, куда были доставлены такие грузы (примечание:
необходимо использовать коррелирующий подзапрос)
6. Перечислить города, в которые не было отправлено ни одного груза
(примечание: необходимо использовать конструкцию EXISTS)
7. Какие города в базе данных имеют наибольшую и наименьшую численность
населения?
*/

/* 2.1 Перечислить города, получавшие грузы от клиентов с годовым доходом свыше*/
Select DISTINCT City
From Transportation
Where ClientId IN(Select ClientId From Client Where Yearlyincome >15000000)

/* 2.2 Перечислить имена и фамилии водителей, доставлявших грузы весом более 100
кг*/
Select DISTINCT DriverFullName From Car
Where CarId IN(Select CarId From Transportation Where Weight >100)

/* 2.3 Перечислить названия и годовые доходы клиентов, отправлявших грузы со
средним весом более 100 кг*/
Select DISTINCT Yearlyincome, Name From Client
Where ClientId IN(Select ClientId From Transportation Where Weight >100)

/* 2.4 Перечислить названия и годовые доходы клиентов, чьи грузы доставлял
водитель по имени Джон*/
Select Name, Yearlyincome
From Client
Where ClientId IN(Select ClientId From Transportation Where CarId IN(Select CarId From Car Where DriverFullName Like 'Джон%'))

/* 2.5 Перечислить имена водителей, доставлявших грузы весом более 1000 кг, с
указанием городов, куда были доставлены такие грузы (примечание:
необходимо использовать коррелирующий подзапрос)*/
Select City, (Select DriverFullName  From Car c Where c.CarId=t.CarId)
From Transportation t
Where Weight >1000

/* 2.6 Перечислить города, в которые не было отправлено ни одного груза
(примечание: необходимо использовать конструкцию EXISTS)*/
SELECT* 
From city c
Where not EXISTS (Select DISTINCT city
                  From Transportation t 
                  Where c.cityname= t.city)

/* 2.7 Какие города в базе данных имеют наибольшую и наименьшую численность
населения?*/
SELECT min(population), max (population)  
From city